app/controllers/data_bundles_controller.rb

SELECT  "data_bundles".* FROM "data_bundles" WHERE "data_bundles"."user_id" = $1 LIMIT 10 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "data_bundles" WHERE "data_bundles"."user_id" = $1  [["user_id", 1]]
---
  def index
    if user_signed_in?
      @data_bundles = current_user.databundles.page(params[:page])

INSERT INTO "data_bundles" ("file", "name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["file", "helloanyone.bundle.zip"], ["name", "Hy One"], ["user_id", 1], ["created_at", "2016-03-01 09:42:23.582020"], ["updated_at", "2016-03-01 09:42:23.582020"]]
---
  def create
    @data_bundle = current_user.databundles.new(data_bundle_params)

    if @data_bundle.save

DELETE FROM "data_bundles" WHERE "data_bundles"."id" = $1  [["id", 5]]
---
  def destroy
    @data_bundle.destroy

SELECT  "data_bundles".* FROM "data_bundles" WHERE "data_bundles"."id" = $1 LIMIT 1  [["id", 5]]
---
  def set_data_bundle
    @data_bundle = DataBundle.find(params[:id])